<?php 
  function lang($word){
    static $words = [
      // header
      "Home" => "الصفحة الرئيسية",
      "why iam special" => "لماذا انا مميز",
      "Recent" => "اخر الاعمال",
      "Experience" => "خبرة",
      "Contact" => "اتصال",
      "Education" => "تعليم",
      "Skills" => "مهارات",
      "GALLERY1TITLE" => "تصميم وتطوير مواقع الويب الوظيفية",
      "GALLERY1BODY" => "بطريقة احترافية وسريعة تتناسب مع أساليب عمل كبرى الشركات المتخصصة",
      "GALLERY2TITLE" => "مواقع متعددة اللغات",
      "GALLERY2BODY" => "بناء وتطوير مواقع متعددة اللغات تقدم محتوى بأكثر من لغة",
      "GALLERY3TITLE" => "مواقع الويب المستجيبة",
      "GALLERY3BODY" => "أنشئ صفحات ويب تكشف عن حجم شاشة الزائر واتجاهها وقم بتغيير التخطيط وفقًا لذلك",
      // intro
      "welcome & introduce" => "أهلا وسهلا بك",
      "NAME" => "أولا! انا اسمي خالد الحايك!",
      "INTRO" => "درست وتخرجت في الجامعة اللبنانية الدولية بدرجة البكالوريوس في علوم الكمبيوتر. أحب دائمًا تعلم أشياء جديدة في مجال عملي وأن أكون أكثر احترافًا أثناء القيام بواجبي في عملي أو بعيدا عنه في جميع الأعمال المستقلة التي قمت بها. آمل أن أبدأ العمل لاكتساب الخبرة وإثبات نفسي.",
      "why choose me" => "لماذا تختارني؟",
      "CHOOSEBODY1" => "أتقن لغات البرمجة مثل HTML و CSS و JavaScript و jQuery. مع فهم مبادئ تحسين محركات البحث ،
      امتلك مهارات ممتازة في حل المشكلات وفهم التطوير من جانب الخادم ، فأنا اختيار جيد لك لتوظيفي!",
      "CHOOSEBODY2" => "من ذوي الخبرة في تطبيقات تصميم الرسوم (على سبيل المثال ، Adobe Photoshop و Adobe Experience Design). انفذ واطور
      مواقع الويب التي تبدأ من التصميم وتنتهي بالكود. ما تشاهده الآن تم تصميمه قبل تطويره وكتابة اكواده.",
      "CHOOSEBODY3" => "اجيد التواصل مع أعضاء الفريق والرؤساء والعملاء ومهارات التعامل مع الآخرين. بارع في التعاون مع زملائي في الفريق بسبب معرفتي بأنظمة التحكم في الإصدارات مثل git & github.",
      // expertises
      "what i do" => "ما أفعله",
      "expertise" => "هنا بعض من خبرتي",
      "EXPERTISE1TITLE" => "نهج الجوال الأول",
      "EXPERTISE1BODY" => "تصميم و / أو تطوير تجربة للجوال قبل تصميم سطح المكتب على الويب أو أي جهاز آخر.",
      "EXPERTISE2TITLE" => "إصلاح الأخطاء",
      "EXPERTISE2BODY" => "من خلال حل مشكلتي الممتازة ، لا توجد طريقة للخطأ في عملية التطوير الخاصة بي. سيتم حل الأخطاء بمجرد اكتشافها.",
      "EXPERTISE3TITLE" => "أطر CSS والمعالجات المسبقة",
      "EXPERTISE3BODY" => "إن تجنب التكرار وجعل الكود الخاص بي أكثر تنظيماً هو أمر إلزامي بالنسبة لي لتوفير الوقت وتحقيق وظيفتي قبل وقت انتهاء صلاحيتها.",
      "EXPERTISE4TITLE" => "القدرة على التكيف",
      "EXPERTISE4BODY" => "لكي أكون ناجحًا ، أتعلم باستمرار أساليب جديدة. أنا مرن دائمًا ، واستجيب لظروف العمل بشكل فعال ، وعلى استعداد للذهاب إلى التكنولوجيا التي عفا عليها الزمن.",
      "EXPERTISE5TITLE" => "إدارة الوقت",
      "EXPERTISE5BODY" => "تعتبر إدارة الوقت والتنظيم والقدرة على تحديد أولويات المهام ذات أهمية قصوى بالنسبة لي لكي أصبح مطورًا ناجحًا.",
      "EXPERTISE6TITLE" => "العمل بروح الفريق الواحد",
      "EXPERTISE6BODY" => "من الضروري بالنسبة لي معرفة كيفية دعم الأشخاص الآخرين ، وطلب النصيحة عند الحاجة ، وتحسين سير العمل ، وتقديم المنتج النهائي بسرعة.",
      // recents
      "my work" => "عملي",
      "recent work" => "آخر الاعمال",
      "wrok 01" => "العمل 01",
      "WORK1BODY" => "موقع التعليم الإلكتروني الذي يحتوي على الصفحة الرئيسية ولوحة معلومات للمسؤول وواحدة للمدرسين لإدارة المحتوى الخاص بهم في الموقع.",
      "WORK2BODY" => "يحتوي نظام طلب الطعام عبر الإنترنت على لوحة تحكم للمسؤول وواحدة للعملاء لمشاهدة طلباتهم.",
      "wrok 02" => "العمل 02",
      // experience
      "read" => "اقرأ",
      "Website" => "موقع الكتروني",
      "Details" => "تفاصيل",
      "read more" => "اقرأ أكثر",
      "Finished" => "تم الانتهاء منه",
      "Under Modifying" => "تحت التعديل",
      // contact
      "Get in Touch" => "ابقى على تواصل!",
      "CONTACTBODY" => "متاح عند الطلب. الرجاء عدم التردد بالاتصال بي.",
      "CONTACTBUTTON" => "اتصل بي",
      // rate
      "RATETITLE" => "قيم تجربتك بشكل عام.",
      "Rate now" => "قيم الآن",
      "Don't show again" => "لا تظهر مرة أخرى",
      "Name" => "الاسم",
      "Overall rating" => "التصنيف العام (0-10)",
      "Rate" => "تقييم",
      // skills
      "SKILLSTITLE" => "مهارات",
      "SKILLSBODY" => "اللغات والأدوات",
      "MORETOOLSTITLE" => "ستجد المزيد من الأدوات واللغات مدرجة في سيرتي الذاتية.",
      "DOWNLAODBTN" => "قم بتنزيل سيرتي الذاتية",
    ];

    return $words[$word];
  }
?>